{"patch_notes":[{"title":"OVERWATCH 2 PATCH NOTES – JANUARY 21, 2025","date":"21 January 2025","sections":[{"title":"YEAR OF THE SNAKE SEASONAL EVENT","description":"Celebrate the Lunar New Year - Year of the Snake - in Overwatch 2 with the return of Mischief & Magic, a festive game mode that blends strategy, stealth, and skill along with Bounty Hunter and Capture the Flag. Complete event challenges to unlock exclusive rewards, including Lunar New Year-themed cosmetics that capture the joy and vibrancy of the season. Don’t miss your chance to outwit, outplay, and outlast your opponents!\n","general_updates":[],"hero_updates":[]},{"title":"VALENTINE’S DAY 2025","description":"Take aim and fall in love again with the return of the Love of Geometry game mode. This team Deathmatch brawl pits teams of four Cupid Hanzos against each other. Be sure to watch out as hiding around corners is not safe as everyone can use the original Scatter Arrow ability for Hanzo. This is an event that you’ll fall in love with again as it runs from February 4 to February 18.\n","general_updates":[],"hero_updates":[]},{"title":"6V6 EXPERIMENTAL - MINIMUM 1, MAXIMUM 3","description":"Step back into Overwatch’s origins even more with a fresh twist on the beloved six-player team format. The 6v6 Min 1, Max 3 Mode is a unique experiment that blends nostalgia with modern gameplay dynamics, offering a structured composition alongside the flexibility to switch roles mid-match. And your participation in this experiment will help shape the future of Overwatch 2’s gameplay—so don’t miss this chance to leave your mark.\n\nHeroes are selected first come, first serve.\nEach team must have at least one hero from all three roles, but cannot have more than three heroes from any given role.\nPlayers can switch between roles while in the spawn room.\nHero balance for this experiment uses the same hero balance from the 6v6 2-2-2 Role Queue experiment.\nThis game mode is available to play in Unranked from January 21 to February 3.\n\n","general_updates":[],"hero_updates":[]},{"title":"OVERWATCH CLASSIC - MOTH META","description":"Overwatch Classic - Moth Meta brings you back to one of the most iconic and chaotic chapters in Overwatch history. Mercy’s legendary “Moth” gameplay takes the spotlight as her lightning-fast Resurrects redefine team fights, while heroes like DPS Doomfist and Symmetra with her Shield Generator make a triumphant return to the battlefield. Step onto beloved maps Oasis, Eichenwalde, and Junkertown, where every skirmish is packed with nostalgic strategies and unpredictable mayhem.\n\nHeroes added include Ana, Sombra, Orisa, and Doomfist.\nMaps added include Eichenwalde, Oasis, Horizon Lunar Colony, and Junkertown.\nHero balance is adjusted to the September 2017 Hero Balance.\n\n","general_updates":[],"hero_updates":[]},{"title":"NEW MYTHIC WEAPON - ASHE'S LEAD ROSE","description":"Our latest Mythic Weapon is Ashe's Lead Rose. Growing up in the Lead Rose Manor, Ashe was expected to be the perfect daughter. But while her parents had hoped for a flawless rose, they never expected Ashe's thorns. Like Ashe, this weapon is both beautiful and lethal. The more Ashe embraces her rebellious nature by earning eliminations, the more she blooms into the person she was meant to be! At level one, players will unlock her base Mythic weapon. Level two unlocks reactivity and the Mythic HUD. The beloved flourish is on Level Three which allows Ashe to tauntingly toss a rose at her opponents. And Level Four is the elimination effects, exploding enemies in a burst of rose petals.\n","general_updates":[],"hero_updates":[]},{"title":"COMPETITIVE UPDATES","description":null,"general_updates":[{"title":"COMPETITIVE DRIVES","description":"*   A new Drives signature is available to earn from February 11 to February 16\n*   To celebrate the end of the 2024 Competitive Year, players can earn up to 6,000 Competitive Points (instead of the usual 3,000) by completing Competitive Drive Stages for this season only, enough to unlock 2 Jade or Golden Weapon Variants."},{"title":"COMPETITIVE REWARDS","description":"*   As the 2024 Competitive Year concludes, Season 14 is the last chance to redeem Competitive Points for Jade Weapon Variants. After Season 14 is complete, any accumulated Competitive Points will be converted to Legacy Competitive Points which can be redeemed for Golden Weapon Variants. Jade Weapon Variants will not be available to collect starting in Season 15."}],"hero_updates":[]},{"title":"HERO UPDATES","description":"These hero balance updates only apply to our standard game modes and not the 6v6 Experiment or Overwatch Classic.\n","general_updates":[],"hero_updates":[]},{"title":"TANK","description":null,"general_updates":[],"hero_updates":[{"icon":"https://d15f34w2p8l1cc.cloudfront.net/overwatch/cf69d4bfa61ac14f61d3d541b0d2687a20fa24f55afe7a392d746f5ccb138dea.png","name":"Ramattra","body":"Developer Comment: Ramattra has been underperforming relative to other brawl tanks. Adding a small increase to his armor will provide a necessary boost without altering his core gameplay.\n\n*   Base Armor increased from 75 to 100"},{"icon":"https://d15f34w2p8l1cc.cloudfront.net/overwatch/6a9a37012551410b46b2c28146404354fe21e4a1e8ea65db4e1e497eeaa05c71.png","name":"Winston","body":"Developer Comment: Winston's dive potential has been impacted by the increased health pools of enemies. By boosting the damage of the Tesla Cannon's secondary fire and providing more ammo, this will allow Winston to follow up and finish off enemies without needing to reload as often.\n\n![](https://d15f34w2p8l1cc.cloudfront.net/overwatch/050de92c7ce31e42368c796d9c246210a40bb1bd4a5273b2d64d8a980e1f9f9a.png)\n\nTesla Cannon\n\n*   Ammo increased from 100 to 120\n*   Secondary fire max charge damage increased from 50 to 60\n\n![](https://d15f34w2p8l1cc.cloudfront.net/overwatch/685608721cb914e0412a090eb1e89c0f5d10edfb3dbc34218ba3acd35611c990.png)\n\nPrimal Rage\n\n*   Ultimate ability cost increased by 12%"},{"icon":"https://d15f34w2p8l1cc.cloudfront.net/overwatch/22fc6ca76249d7cd37bad808d53a68986da855c625475a46ec3858abecf57823.png","name":"Hazard","body":"Developer Comment: We’re finding our newest tank’s mobility to be a little too hazardous. By decreasing Violent Leap’s cooldown, Hazard will have to be more selective with how he dives into the opponent backlines.\n\n![](https://d15f34w2p8l1cc.cloudfront.net/overwatch/0b5166ae3ab7ad67f4a91e9fd2e9be34df9febef4cc2e9843d1d284c1601c2f3.png)\n\nViolent Leap\n\n*   Violent Leap cooldown increased from 5 to 6 seconds."}]},{"title":"DAMAGE","description":null,"general_updates":[],"hero_updates":[{"icon":"https://d15f34w2p8l1cc.cloudfront.net/overwatch/0dc3f1679d739ef530ba2b8cbe02bf09f4d40a57c0af84f694a3241d3a7ef948.png","name":"Echo","body":"Developer Comment: Echo has been slightly underperforming recently, so we are increasing the base damage of the Focusing Beam. This change will make it easier to push enemies into the critical health threshold.\n\n![](https://d15f34w2p8l1cc.cloudfront.net/overwatch/6552feeb85a32ae7131df50f61a9c0fa24bf347bf007e208a356a940561129ae.png)\n\nFocusing Beam\n\n*   Damage-per-second on targets above 50% HP increased from 50 to 75."},{"icon":"https://d15f34w2p8l1cc.cloudfront.net/overwatch/5ee20a1feed14da5153f19745328e9fc02bd79f8109593a9b7dab9283eb9629b.png","name":"Tracer","body":"Developer Comment: Tracer has remained less threatening since the damage reduction to her Pulse Pistols. Reducing their spread will make her damage more consistent at slightly longer ranges.\n\n![](https://d15f34w2p8l1cc.cloudfront.net/overwatch/82520ccd791a5befa5ac74a6b5263471de44b0674abb07fbf1568c149c88a91a.png)\n\nPulse Pistols\n\n*   Spread decreased by 15%"}]},{"title":"SUPPORT","description":null,"general_updates":[],"hero_updates":[{"icon":"https://d15f34w2p8l1cc.cloudfront.net/overwatch/86debddbaaaf8699d68775a9dbffaf5b8db514772b77ff7234b1ff84c0b29fd5.png","name":"Ana","body":"Developer Comment: Recent changes to her rifle have made Ana a highly impactful support. Reducing the damage of her Biotic Grenade will adjust some of her breakpoints and slightly affect her self-sustainability.\n\n![](https://d15f34w2p8l1cc.cloudfront.net/overwatch/c8190b234bf0a0e28eecffe162d0c942e6b8656e95f4688c6ca3b025fa5a487d.png)\n\nBiotic Grenade\n\n*   Explosion damage and healing decreased from 90 to 75."},{"icon":"https://d15f34w2p8l1cc.cloudfront.net/overwatch/f33f6fe94ad55fcf9027e779f66afac358a2f93651070b95cd565ff90d670c8b.png","name":"Illari","body":"Developer Comment: lllari can struggle to heal allies without her Healing Pylon. Increasing the maximum resource of her secondary fire will allow her to support her team more effectively during those moments.\n\n![](https://d15f34w2p8l1cc.cloudfront.net/overwatch/5774f1b455a15ec3a3671e5df55fbd3b3c9ff5965943b0b255fb17ccb30d9fa1.png)\n\nSolar Rifle\n\nSecondary Fire Maximum resource increased from 3 to 3.5 seconds."},{"icon":"https://d15f34w2p8l1cc.cloudfront.net/overwatch/2a65bf12035f9c255833693224cad83fd98cead625fdf1b9da8359a7f259e01c.png","name":"Juno","body":"Developer Comment: Juno’s ultimate remains too powerful when used effectively by her allies. Reducing both the duration and damage amplification will reduce the potency of the ultimate.\n\n![](https://d15f34w2p8l1cc.cloudfront.net/overwatch/b4215620deb362a0ad6a7784275d43b518868392b0f7e77228adabe32a489e77.png)\n\nOrbital Ray\n\n*   Duration reduced from 10 to 8 seconds\n*   Damage amplification reduced from 35% to 30%"}]},{"title":"BUG FIXES","description":null,"general_updates":[{"title":"GENERAL","description":"*   Fixed an issue where competitive titles will sometimes unequip after a logout."},{"title":"MAPS","description":"Circuit Royal\n\n*   Fixed an issue which now prevents turrets from being placed inside the sportscars."},{"title":"HEROES","description":"Bastion\n\n*   Fixed in previous release, fixed an issue causing Bastion's Ultimate to not have impact sounds or VFX.\n\nHazard\n\n*   Fixed an issue where Hazard's Jagged Wall projectiles would pass through certain player made objects such as Cryo-Freeze, Ice Wall, Petal Platform.\n\nSombra\n\n*   Fixed an issue where Sombra's EMP can sometimes fail to hit opponents if they had previously interacted with Jagged Wall.\n\nZenyatta\n\n*   Fixed an issue causing Zenyatta to T-Pose with the \"Retro Hero\" emote."}],"hero_updates":[]}]},{"title":"Overwatch 2 Retail Patch Notes - January 7, 2025","date":"7 January 2025","sections":[{"title":"Hotfix Balance Update","description":"This is a hero balance hotfix. Replay codes from the December 19, 2024 patch are still available.\n","general_updates":[],"hero_updates":[]},{"title":"Hero Balance Updates","description":"These hero balance updates only apply to our standard game modes and not the 6v6 Experiment.\n","general_updates":[],"hero_updates":[]},{"title":"Tank","description":null,"general_updates":[],"hero_updates":[{"icon":"https://d15f34w2p8l1cc.cloudfront.net/overwatch/22fc6ca76249d7cd37bad808d53a68986da855c625475a46ec3858abecf57823.png","name":"Hazard","body":"![](https://d15f34w2p8l1cc.cloudfront.net/overwatch/a558290ba44099a80c0818c45cee31e4c6d1039c81c3fb6154ec8356e3fad9d5.png)\n\nSpike Guard\n\n*   Damage reduction is reduced from 75% to 65%.\n*   Duration reduced from 3.5 to 3 seconds."}]},{"title":"Damage","description":null,"general_updates":[],"hero_updates":[{"icon":"https://d15f34w2p8l1cc.cloudfront.net/overwatch/515f25a729a4a3f51d956fc54c600dc60d8e5242f2b188c178496cea1a2e11b5.png","name":"Sojourn","body":"![](https://d15f34w2p8l1cc.cloudfront.net/overwatch/3d7f261e05e3abda155cede4409ec8348490e286805c123d54d7f81fdd50d077.png)\n\nRailgun\n\n*   Time before energy degeneration begins decreased from 12 to 9 seconds."},{"icon":"https://d15f34w2p8l1cc.cloudfront.net/overwatch/b4871b9addd770582c8b6a1ab366b9ec08d986c2995248ee5fce7e15cb0d809d.png","name":"Widowmaker","body":"![](https://d15f34w2p8l1cc.cloudfront.net/overwatch/13a1e7903c23a5e140aa01fa930f585c1ea69e1e24378c0462f42053085f7ad9.png)\n\nWidow's Kiss\n\n*   Scoped shots no longer benefit from global projectile size increases."}]}]}]}